---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInView
source: html/6e53cb9b-e35c-c650-f208-86556ce7df06.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInView Property

Can't move element because the move plane is seen at a very sharp angle in this View

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveInView { get; }
```